# Membagi Pandas Data Frame menjadi dua secara acak

## Import modules

In [36]:
import pandas as pd #mengimport pandas sebagai pd
import numpy as np #mengimport pandas sebagai np

print(pd.__version__) #menampilkan pandas versi
print(np.__version__) #menampilkan numpy versi

1.1.3
1.19.2

## Persiapan Data Frame

In [37]:
r = 7 #jumlah baris
c = 6 #jumlah colom
cols = tuple('ABCDEF')

df = pd.DataFrame(np.random.randint(1, 20, size=(r, c)),columns=cols)
df

    A   B  C   D   E   F
0   3   5  7   6   8  19
1   8   3  1   1  14   8
2   9  19  9  15   2   8
3  14  18  8   3   3  16
4   9   9  1   2   8  18
5  16  15  5  19  14  13
6  13  11  3   1  10   8

## Membagi Data menjadi dua secara acak dan berdasarkan proporsi tertentu

In [38]:
df.shape

(7, 6)

In [39]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (5, 6)
df_2 shape: (2, 6)

In [40]:
df_1

    A   B  C   D   E   F
4   9   9  1   2   8  18
5  16  15  5  19  14  13
1   8   3  1   1  14   8
0   3   5  7   6   8  19
3  14  18  8   3   3  16

In [41]:
df_2

    A   B  C   D   E  F
2   9  19  9  15   2  8
6  13  11  3   1  10  8